test/Predict_API_Request - linux - 64.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Predict API ">
        <intProp name="ThreadGroup.num_threads">5</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Predict API">
          <stringProp name="HTTPSampler.domain">dev-1viu-api-gateway.ottuat.com</stringProp>
          <stringProp name="HTTPSampler.port">80</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/mobile</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments">
              <elementProp name="keyword" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">true</boolProp>
                <stringProp name="Argument.value">${keyword}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
                <stringProp name="Argument.name">keyword</stringProp>
              </elementProp>
              <elementProp name="platform_flag_label" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">web</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
                <stringProp name="Argument.name">platform_flag_label</stringProp>
              </elementProp>
              <elementProp name="area_id" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">1</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
                <stringProp name="Argument.name">area_id</stringProp>
              </elementProp>
              <elementProp name="language_flag_id" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">1</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
                <stringProp name="Argument.name">language_flag_id</stringProp>
              </elementProp>
              <elementProp name="countryCode" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">SG</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
                <stringProp name="Argument.name">countryCode</stringProp>
              </elementProp>
              <elementProp name="ut" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">0</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
                <stringProp name="Argument.name">ut</stringProp>
              </elementProp>
              <elementProp name="r" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">%2Fsearch%2Fprediction</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
                <stringProp name="Argument.name">r</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Data For Keywords" enabled="true">
          <stringProp name="delimiter">,</stringProp>
          <stringProp name="fileEncoding">UTF-8</stringProp>
          <stringProp name="filename">/jmeter/output/keywords.txt</stringProp>
          <boolProp name="ignoreFirstLine">false</boolProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="variableNames">keyword</stringProp>
        </CSVDataSet>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">D:\JMeter\responses\summary-predict.txt</stringProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="Simple Data Writer" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">/jmeter/output/predict.xml</stringProp>
        </ResultCollector>
        <hashTree/>
        <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="HTTP Code 200 Assertion" enabled="true">
          <collectionProp name="Asserion.test_strings">
            <stringProp name="49586">200</stringProp>
          </collectionProp>
          <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
          <boolProp name="Assertion.assume_success">false</boolProp>
          <intProp name="Assertion.test_type">16</intProp>
        </ResponseAssertion>
        <hashTree/>
        <BeanShellAssertion guiclass="BeanShellAssertionGui" testclass="BeanShellAssertion" testname="Fields Assertion" enabled="true">
          <stringProp name="BeanShellAssertion.query">import org.json.*;
import org.apache.jorphan.util.JMeterException;

String responseCode = prev.getResponseCode();
String responseData = prev.getResponseDataAsString();
JSONObject responseJson = new JSONObject(responseData);
JSONObject data = responseJson.getJSONObject(&quot;data&quot;);


String[] requiredLevel1Fields = {
   &quot;status&quot;, &quot;server&quot;,&quot;data&quot;
};
for (String field : requiredLevel1Fields) {
    if (!responseJson.has(field)) {
        Failure = true;
        FailureMessage = &quot;Assertion failed: Missing field &apos;&quot; + field + &quot;&apos; in response.&quot;;
        log.error(FailureMessage);
        return;
    }
}


JSONObject status = responseJson.getJSONObject(&quot;status&quot;);
int code = status.getInt(&quot;code&quot;);
int expectCode = 0;
if(code != expectCode){
    Failure = true;
    FailureMessage = &quot;Assertion failed: code field is not 0 ! code = &apos;&quot; + code + &quot;&apos; in response.&quot;;
    log.error(FailureMessage);
    return;
}


String[] dataFields = {&quot;series&quot;, &quot;actor&quot;};
for (String field : dataFields) {
    if (!data.has(field)) {
        log.error(&quot;Missing &apos;data&apos; field in response: &quot; + field);
        Failure = true;
        FailureMessage = &quot;Response &apos;data&apos; object is missing a required field: &quot; + field;
        return;
    }
}


JSONArray seriesArray = data.getJSONArray(&quot;series&quot;);
if (seriesArray != null &amp;&amp; seriesArray.length() &gt; 0) {
    for (int i = 0; i &lt; seriesArray.length(); i++) {
        JSONObject seriesItem = seriesArray.getJSONObject(i);
        String[] seriesFields = {&quot;id&quot;, &quot;name&quot;, &quot;weight&quot;, &quot;source_flag&quot;};
        for (String field : seriesFields) {
            if (!seriesItem.has(field)) {
                log.error(&quot;Missing field in &apos;series&apos; array at index &quot; + i + &quot;: &quot; + field);
        		 Failure = true;
                FailureMessage = &quot;Response &apos;series&apos; array is missing a required field at index &quot; + i + &quot;: &quot; + field;
                return;
            }
        }
    }
}

JSONArray actorArray = data.getJSONArray(&quot;actor&quot;);
if (actorArray != null &amp;&amp; actorArray.length() &gt; 0) {
    for (int i = 0; i &lt; actorArray.length(); i++) {
        JSONObject actorItem = actorArray.getJSONObject(i);
        String[] actorFields = {&quot;id&quot;, &quot;name&quot;};
        for (String field : actorFields) {
            if (!actorItem.has(field)) {
                log.error(&quot;Missing field in &apos;actor&apos; array at index &quot; + i + &quot;: &quot; + field);
                Failure = true;
                FailureMessage = &quot;Response &apos;actor&apos; array is missing a required field at index &quot; + i + &quot;: &quot; + field;
                return;
            }
        }
    }
}


Failure = false;</stringProp>
          <boolProp name="BeanShellAssertion.resetInterpreter">false</boolProp>
        </BeanShellAssertion>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>